package com.devtarak.cbpi;

import androidx.annotation.NonNull;
import androidx.appcompat.app.AppCompatActivity;
import androidx.core.content.ContextCompat;

import android.content.Intent;
import android.graphics.Color;
import android.graphics.drawable.ColorDrawable;
import android.os.Bundle;
import android.text.Html;
import android.view.Menu;
import android.view.MenuInflater;
import android.view.MenuItem;
import android.widget.TextView;

public class BecomeSoftwareEng extends AppCompatActivity {
    TextView textSoftShow;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_become_software_eng);
        textSoftShow = findViewById(R.id.textSoftShow);
        if (android.os.Build.VERSION.SDK_INT >= android.os.Build.VERSION_CODES.N) {
            textSoftShow.setText(Html.fromHtml("<b>স্ব-মূল্যায়ন:</b>\n" +
                    "<ol>\n" +
                    "    <li><b>আগ্রহ ও দক্ষতা:</b> আপনি কি সমস্যা সমাধান, যৌক্তিক চিন্তাভাবনা এবং কিছু তৈরি করতে উপভোগ করেন? আপনি কি আগে কোডিংয়ের সাথে যুক্ত ছিলেন? আসল আগ্রহ এবং কিছু মৌলিক দক্ষতা অনেক দূর যেতে পারে।</li>\n" +
                    "    <li> <b>গবেষণা ও লক্ষ্য:</b> বিভিন্ন সফটওয়্যার ইঞ্জিনিয়ারিং বিশেষীকরণ (ফ্রন্ট-এন্ড, ব্যাক-এন্ড, মোবাইল ইত্যাদি) অনুসন্ধান করুন এবং তাদের প্রয়োজনীয়তা বুঝুন। আপনার ক্যারিয়ারের লক্ষ্য এবং পছন্দসই সময়সীমা নির্ধারণ করুন।</li>\n" +
                    "</ol>\n" +
                    "<b>শিক্ষা ও দক্ষতা বিকাশ:</b>\n" +
                    "<br><b>আনুষ্ঠানিক শিক্ষা (ঐচ্ছিক):</b>\n" +
                    "<ol>\n" +
                    "    <li><b>ডিগ্রি:</b> বাধ্যতামূলক না হলেও, কম্পিউটার বিজ্ঞান, তথ্যপ্রযুক্তি বা সম্পর্কিত ক্ষেত্রে স্নাতক ডিগ্রি প্রোগ্রামিং, অ্যালগোরিদম এবং সফটওয়্যার ডেভেলপমেন্ট নীতিমালায় দৃঢ় ভিত্তি প্রদান করে।</li>\n" +
                    "    <li><b>বুটক্যাম্প:</b> নিবিড় কোডিং বুটক্যাম্পগুলি দ্রুত গতিতে শেখার সুযোগ দেয় এবং ক্যারিয়ার পরিবর্তনকারী বা নির্দিষ্ট দক্ষতা চাওয়া ব্যক্তিদের জন্য উপযুক্ত হতে পারে।</li>\n" +
                    "</ol>\n" +
                    "<b>স্ব-নির্দেশিত শিক্ষা:</b>\n" +
                    "<ol>\n" +
                    "    <li> <b>অনলাইন কোর্স:</b> Coursera, edX এবং Udacity-এর মতো প্ল্যাটফর্মগুলি প্রোগ্রামিং ভাষা, ফ্রেমওয়ার্ক এবং টুল শেখার জন্য বিভিন্ন কোর্স এবং বিশেষীকরণ অফার করে।</li>\n" +
                    "    <li><b>অভ্যাস ও প্রকল্প:</b> অনলাইন কোডিং চ্যালেঞ্জে অংশগ্রহণ করুন, ওপেন-সোর্স প্রকল্পগুলিতে অবদান রাখুন এবং ব্যক্তিগত প্রকল্প তৈরি করুন যাতে করে আপনি প্রায়োগিক অভিজ্ঞতা অর্জন করতে পারেন এবং আপনার দক্ষতা প্রদর্শন করতে পারেন।</li>\n" +
                    "</ol>\n" +
                    "<b>টেকনিক্যাল দক্ষতা:</b>\n" +
                    "<ol>\n" +
                    "    <li><b>প্রোগ্রামিং ভাষা:</b> পাইথন, জাভা বা জাভাস্ক্রিপ্টের মতো একটি ভাষা দিয়ে শুরু করুন এবং ধীরে ধীরে আপনার পছন্দসই বিশেষীকরণের সাথে সম্পর্কিত অন্যান্য ভাষা অনুসন্ধান করুন।</li>\n" +
                    "    <li><b>ডেটা স্ট্রাকচার ও অ্যালগোরিদম:</b>> ফলপ্রসূ সমস্যা সমাধানের জন্য মৌলিক ডেটা স্ট্রাকচার (অ্যারে, লিংকড লিস্ট, ট্রি ইত্যাদি) এবং অ্যালগোরিদম (সাজানো, অনুসন্ধান ইত্যাদি) আয়ত্ত করুন।</li>\n" +
                    "    <li><strong>ডাটাবেস:</strong> SQL, MySQL, PostgreSQL, MongoDB, ইত্যাদি।</li>\n" +
                    "    <li><strong>ওয়েব ডেভেলপমেন্ট:</strong> HTML, CSS, JavaScript, React, Angular, Vue.js, ইত্যাদি।</li>\n" +
                    "    <li><strong>অপারেটিং সিস্টেম:</strong> Linux, Windows, macOS, ইত্যাদি।</li>\n" +
                    "  </ul>\n" +
                    "\n" +
                    "  <h3>নরম দক্ষতা:</h3>\n" +
                    "    <li><b>ভার্সন কন্ট্রোল সিস্টেম (VCS):</b> Git-এর মতো ভার্সন কন্ট্রোল সিস্টেমগুলিকে দক্ষতার সাথে কোড পরিচালনা এবং সহযোগিতা করার জন্য শিখুন।</li>\n" +
                    "    <li><b>সফটওয়্যার ডেভেলপমেন্ট টুলস:</b> বিল্ড সিস্টেম, টেস্টিং ফ্রেমওয়ার্ক এবং ডিবাগিং টুলসের মতো সাধারণ সফটওয়্যার ডেভেলপমেন্ট টুলগুলি সম্পর্কে জ্ঞান অর্জন করুন।</li>\n" +
                    "</ol>\n" +
                    "<b>সফট স্কিল্লসঃ </b>\n" +
                    "<ol>\n" +
                    "    <li><strong>সমস্যা সমাধান:</strong> জটিল সমস্যাগুলিকে ছোট ছোট অংশে বিভক্ত করুন, সম্ভাব্য সমাধানগুলির মূল্যায়ন করুন এবং কার্যকর সমাধান বাস্তবায়িত করুন। বাইরে-থেকে-চিন্তাভাবনা এবং নতুন দৃষ্টিকোণ খোঁজার দক্ষতা গড়ে তুলুন।</li>\n" +
                    "    <li><strong>টিমওয়ার্ক:</strong> সহযোগিতা, যোগাযোগ এবং দ্বন্দ্ব নিরসনে দক্ষতা গড়ে তুলুন। সফটওয়্যার প্রকল্পগুলি সাধারণত টিম হিসাবে কাজ করা হয়, তাই আপনার সাথীদের সাথে সুন্দর সম্পর্ক গড়ে তোলা এবং তাদের সাথে কার্যকরভাবে যোগাযোগ করতে পারা গুরুত্বপূর্ণ।</li>\n" +
                    "    <li><strong>যোগাযোগ:</strong> কারিগরি বিষয়গুলি সহজ ভাষায় ব্যাখ্যা করতে এবং লিখিত ও মৌখিকভাবে পরিষ্কারভাবে যোগাযোগ করতে সক্ষম হওয়া প্রয়োজন। বিভিন্ন ক্ষেত্রের লোকজনের সাথে যোগাযোগ করার জন্য আপনার যোগাযোগ দক্ষতা শক্তিশালী করা গুরুত্বপূর্ণ।</li>\n" +
                    "    <li><b>সময় ব্যবস্থাপনা:</b> কাজের সময়সীমা পূরণ করতে এবং একাধিক কাজের মধ্যে ভারসাম্য বজায় রাখতে আপনার সময়কে কার্যকরভাবে ব্যবহার করতে শিখুন।</li>\n" +
                    "</ol>\n" +
                    "<b>ক্যারিয়ার গড়ে তোলা: </b>\n" +
                    "<ol>\n" +
                    "    <li><b>ইন্টার্নশিপ ও ফ্রিল্যান্স কাজ:</b> অভিজ্ঞতা অর্জন এবং আপনার দক্ষতা প্রদর্শন করার জন্য ইন্টার্নশিপ বা ফ্রিল্যান্স কাজের সুযোগ নিন।</li>\n" +
                    "    <li><b>পেশাগত নেটওয়ার্ক:</b> অন্যান্য সফটওয়্যার ইঞ্জিনিয়ার, রিক্রুটার এবং শিল্পের অভিজ্ঞাদের সাথে সংযোগ স্থাপন করুন।</li>\n" +
                    "    <li><b>পোর্টফোলিও তৈরি করুন:</b> আপনার সেরা কাজের নমুনা সহ একটি অনলাইন বা অফলাইন পোর্টফোলিও তৈরি করুন যা সম্ভাব্য নিয়োগকর্তাদের দেখাতে পারেন।</li>\n" +
                    "    <li><b>চাকরির আবেদন ও সাক্ষাৎকার:</b> আপনার আগ্রহ এবং দক্ষতা প্রদর্শন করার জন্য ভালোভাবে চাকরির আবেদন লিখুন এবং সাক্ষাৎকারের জন্য প্রস্তুত থাকুন।</li>\n" +
                    "</ol>\n" +
                    "<b>মনে রাখবেন: </b>\n" +
                    "একজন সফ্টওয়্যার ইঞ্জিনিয়ার হওয়ার যাত্রা ক্রমাগত শেখা। নতুন প্রযুক্তি, প্রবণতা এবং সর্বোত্তম অনুশীলনের সাথে আপডেট থাকুন। চ্যালেঞ্জগুলিকে আলিঙ্গন করুন, অবিচল থাকুন এবং কোডের সাথে শেখার এবং তৈরি করার প্রক্রিয়া উপভোগ করুন!\n" +
                    "<b>অতিরিক্ত সম্পদ:</b>\n" +
                    "<ol>\n" +
                    "    <li><b>ফ্রিকোডক্যাম্প:</b> https://www.freecodecamp.org/</li>\n" +
                    "    <li><b>ওডিন প্রকল্প:</b> https://www.theodinproject.com/</li>\n" +
                    "    <li><b>মজিলা ডেভেলপার নেটওয়ার্ক:</b> https://developer.mozilla.org/</li>\n" +
                    "    <li><b>গিটহাব:</b> https://github.com/index</li>\n" +
                    "</ol>\n" +
                    "আমি আশা করি এই ব্যাপক রোডম্যাপ আপনাকে একজন সফ্টওয়্যার প্রকৌশলী হওয়ার যাত্রায় নেভিগেট করতে সাহায্য করবে। আপনার যদি আরও প্রশ্ন থাকে তবে নির্দ্বিধায় জিজ্ঞাসা করুন!", Html.FROM_HTML_MODE_LEGACY));
        } else {
            textSoftShow.setText(Html.fromHtml("<b>স্ব-মূল্যায়ন:</b>\n" +
                    "<ol>\n" +
                    "    <li><b>আগ্রহ ও দক্ষতা:</b> আপনি কি সমস্যা সমাধান, যৌক্তিক চিন্তাভাবনা এবং কিছু তৈরি করতে উপভোগ করেন? আপনি কি আগে কোডিংয়ের সাথে যুক্ত ছিলেন? আসল আগ্রহ এবং কিছু মৌলিক দক্ষতা অনেক দূর যেতে পারে।</li>\n" +
                    "    <li> <b>গবেষণা ও লক্ষ্য:</b> বিভিন্ন সফটওয়্যার ইঞ্জিনিয়ারিং বিশেষীকরণ (ফ্রন্ট-এন্ড, ব্যাক-এন্ড, মোবাইল ইত্যাদি) অনুসন্ধান করুন এবং তাদের প্রয়োজনীয়তা বুঝুন। আপনার ক্যারিয়ারের লক্ষ্য এবং পছন্দসই সময়সীমা নির্ধারণ করুন।</li>\n" +
                    "</ol>\n" +
                    "<b>শিক্ষা ও দক্ষতা বিকাশ:</b>\n" +
                    "<br><b>আনুষ্ঠানিক শিক্ষা (ঐচ্ছিক):</b>\n" +
                    "<ol>\n" +
                    "    <li><b>ডিগ্রি:</b> বাধ্যতামূলক না হলেও, কম্পিউটার বিজ্ঞান, তথ্যপ্রযুক্তি বা সম্পর্কিত ক্ষেত্রে স্নাতক ডিগ্রি প্রোগ্রামিং, অ্যালগোরিদম এবং সফটওয়্যার ডেভেলপমেন্ট নীতিমালায় দৃঢ় ভিত্তি প্রদান করে।</li>\n" +
                    "    <li><b>বুটক্যাম্প:</b> নিবিড় কোডিং বুটক্যাম্পগুলি দ্রুত গতিতে শেখার সুযোগ দেয় এবং ক্যারিয়ার পরিবর্তনকারী বা নির্দিষ্ট দক্ষতা চাওয়া ব্যক্তিদের জন্য উপযুক্ত হতে পারে।</li>\n" +
                    "</ol>\n" +
                    "<b>স্ব-নির্দেশিত শিক্ষা:</b>\n" +
                    "<ol>\n" +
                    "    <li> <b>অনলাইন কোর্স:</b> Coursera, edX এবং Udacity-এর মতো প্ল্যাটফর্মগুলি প্রোগ্রামিং ভাষা, ফ্রেমওয়ার্ক এবং টুল শেখার জন্য বিভিন্ন কোর্স এবং বিশেষীকরণ অফার করে।</li>\n" +
                    "    <li><b>অভ্যাস ও প্রকল্প:</b> অনলাইন কোডিং চ্যালেঞ্জে অংশগ্রহণ করুন, ওপেন-সোর্স প্রকল্পগুলিতে অবদান রাখুন এবং ব্যক্তিগত প্রকল্প তৈরি করুন যাতে করে আপনি প্রায়োগিক অভিজ্ঞতা অর্জন করতে পারেন এবং আপনার দক্ষতা প্রদর্শন করতে পারেন।</li>\n" +
                    "</ol>\n" +
                    "<b>টেকনিক্যাল দক্ষতা:</b>\n" +
                    "<ol>\n" +
                    "    <li><b>প্রোগ্রামিং ভাষা:</b> পাইথন, জাভা বা জাভাস্ক্রিপ্টের মতো একটি ভাষা দিয়ে শুরু করুন এবং ধীরে ধীরে আপনার পছন্দসই বিশেষীকরণের সাথে সম্পর্কিত অন্যান্য ভাষা অনুসন্ধান করুন।</li>\n" +
                    "    <li><b>ডেটা স্ট্রাকচার ও অ্যালগোরিদম:</b>> ফলপ্রসূ সমস্যা সমাধানের জন্য মৌলিক ডেটা স্ট্রাকচার (অ্যারে, লিংকড লিস্ট, ট্রি ইত্যাদি) এবং অ্যালগোরিদম (সাজানো, অনুসন্ধান ইত্যাদি) আয়ত্ত করুন।</li>\n" +
                    "    <li><strong>ডাটাবেস:</strong> SQL, MySQL, PostgreSQL, MongoDB, ইত্যাদি।</li>\n" +
                    "    <li><strong>ওয়েব ডেভেলপমেন্ট:</strong> HTML, CSS, JavaScript, React, Angular, Vue.js, ইত্যাদি।</li>\n" +
                    "    <li><strong>অপারেটিং সিস্টেম:</strong> Linux, Windows, macOS, ইত্যাদি।</li>\n" +
                    "  </ul>\n" +
                    "\n" +
                    "  <h3>নরম দক্ষতা:</h3>\n" +
                    "    <li><b>ভার্সন কন্ট্রোল সিস্টেম (VCS):</b> Git-এর মতো ভার্সন কন্ট্রোল সিস্টেমগুলিকে দক্ষতার সাথে কোড পরিচালনা এবং সহযোগিতা করার জন্য শিখুন।</li>\n" +
                    "    <li><b>সফটওয়্যার ডেভেলপমেন্ট টুলস:</b> বিল্ড সিস্টেম, টেস্টিং ফ্রেমওয়ার্ক এবং ডিবাগিং টুলসের মতো সাধারণ সফটওয়্যার ডেভেলপমেন্ট টুলগুলি সম্পর্কে জ্ঞান অর্জন করুন।</li>\n" +
                    "</ol>\n" +
                    "<b>সফট স্কিল্লসঃ </b>\n" +
                    "<ol>\n" +
                    "    <li><strong>সমস্যা সমাধান:</strong> জটিল সমস্যাগুলিকে ছোট ছোট অংশে বিভক্ত করুন, সম্ভাব্য সমাধানগুলির মূল্যায়ন করুন এবং কার্যকর সমাধান বাস্তবায়িত করুন। বাইরে-থেকে-চিন্তাভাবনা এবং নতুন দৃষ্টিকোণ খোঁজার দক্ষতা গড়ে তুলুন।</li>\n" +
                    "    <li><strong>টিমওয়ার্ক:</strong> সহযোগিতা, যোগাযোগ এবং দ্বন্দ্ব নিরসনে দক্ষতা গড়ে তুলুন। সফটওয়্যার প্রকল্পগুলি সাধারণত টিম হিসাবে কাজ করা হয়, তাই আপনার সাথীদের সাথে সুন্দর সম্পর্ক গড়ে তোলা এবং তাদের সাথে কার্যকরভাবে যোগাযোগ করতে পারা গুরুত্বপূর্ণ।</li>\n" +
                    "    <li><strong>যোগাযোগ:</strong> কারিগরি বিষয়গুলি সহজ ভাষায় ব্যাখ্যা করতে এবং লিখিত ও মৌখিকভাবে পরিষ্কারভাবে যোগাযোগ করতে সক্ষম হওয়া প্রয়োজন। বিভিন্ন ক্ষেত্রের লোকজনের সাথে যোগাযোগ করার জন্য আপনার যোগাযোগ দক্ষতা শক্তিশালী করা গুরুত্বপূর্ণ।</li>\n" +
                    "    <li><b>সময় ব্যবস্থাপনা:</b> কাজের সময়সীমা পূরণ করতে এবং একাধিক কাজের মধ্যে ভারসাম্য বজায় রাখতে আপনার সময়কে কার্যকরভাবে ব্যবহার করতে শিখুন।</li>\n" +
                    "</ol>\n" +
                    "<b>ক্যারিয়ার গড়ে তোলা: </b>\n" +
                    "<ol>\n" +
                    "    <li><b>ইন্টার্নশিপ ও ফ্রিল্যান্স কাজ:</b> অভিজ্ঞতা অর্জন এবং আপনার দক্ষতা প্রদর্শন করার জন্য ইন্টার্নশিপ বা ফ্রিল্যান্স কাজের সুযোগ নিন।</li>\n" +
                    "    <li><b>পেশাগত নেটওয়ার্ক:</b> অন্যান্য সফটওয়্যার ইঞ্জিনিয়ার, রিক্রুটার এবং শিল্পের অভিজ্ঞাদের সাথে সংযোগ স্থাপন করুন।</li>\n" +
                    "    <li><b>পোর্টফোলিও তৈরি করুন:</b> আপনার সেরা কাজের নমুনা সহ একটি অনলাইন বা অফলাইন পোর্টফোলিও তৈরি করুন যা সম্ভাব্য নিয়োগকর্তাদের দেখাতে পারেন।</li>\n" +
                    "    <li><b>চাকরির আবেদন ও সাক্ষাৎকার:</b> আপনার আগ্রহ এবং দক্ষতা প্রদর্শন করার জন্য ভালোভাবে চাকরির আবেদন লিখুন এবং সাক্ষাৎকারের জন্য প্রস্তুত থাকুন।</li>\n" +
                    "</ol>\n" +
                    "<b>মনে রাখবেন: </b>\n" +
                    "একজন সফ্টওয়্যার ইঞ্জিনিয়ার হওয়ার যাত্রা ক্রমাগত শেখা। নতুন প্রযুক্তি, প্রবণতা এবং সর্বোত্তম অনুশীলনের সাথে আপডেট থাকুন। চ্যালেঞ্জগুলিকে আলিঙ্গন করুন, অবিচল থাকুন এবং কোডের সাথে শেখার এবং তৈরি করার প্রক্রিয়া উপভোগ করুন!\n" +
                    "<b>অতিরিক্ত সম্পদ:</b>\n" +
                    "<ol>\n" +
                    "    <li><b>ফ্রিকোডক্যাম্প:</b> https://www.freecodecamp.org/</li>\n" +
                    "    <li><b>ওডিন প্রকল্প:</b> https://www.theodinproject.com/</li>\n" +
                    "    <li><b>মজিলা ডেভেলপার নেটওয়ার্ক:</b> https://developer.mozilla.org/</li>\n" +
                    "    <li><b>গিটহাব:</b> https://github.com/index</li>\n" +
                    "</ol>\n" +
                    "আমি আশা করি এই ব্যাপক রোডম্যাপ আপনাকে একজন সফ্টওয়্যার প্রকৌশলী হওয়ার যাত্রায় নেভিগেট করতে সাহায্য করবে। আপনার যদি আরও প্রশ্ন থাকে তবে নির্দ্বিধায় জিজ্ঞাসা করুন!"));
        }


        //mendotory for every page
        getSupportActionBar().setDisplayHomeAsUpEnabled(true);
        getSupportActionBar().setHomeAsUpIndicator(R.drawable.baseline_arrow_back_ios_24);
        getWindow().setNavigationBarColor(ContextCompat.getColor(this,R.color.Green));
        getSupportActionBar().setTitle("Software Engineer");
        getSupportActionBar().setBackgroundDrawable(new ColorDrawable(Color.parseColor("#609513")));
    }
    @Override
    public boolean onCreateOptionsMenu(Menu menu) {
        MenuInflater inflater=getMenuInflater();
        inflater.inflate(R.menu.new_menu,menu);
        return true;
    }
    @Override
    public boolean onOptionsItemSelected(@NonNull MenuItem item) {
        int itemId = item.getItemId();

        if (itemId == R.id.menItem1) {
            // Share option
            Intent shareIntent = new Intent(Intent.ACTION_SEND);
            shareIntent.setType("text/plain");
            shareIntent.putExtra(Intent.EXTRA_SUBJECT, "Get CBPI Official Application");
            shareIntent.putExtra(Intent.EXTRA_TEXT, getString(R.string.app_share));
            startActivity(Intent.createChooser(shareIntent, "Share via"));
            return true;

        } else if (itemId == R.id.menItem2) {
            // Team option
            Intent teamIntent = new Intent(this, Team.class);
            startActivity(teamIntent);
            return true;

        }else if (itemId == R.id.menuItem3) {
            // Team option
            Intent versionIntent = new Intent(this, version.class);
            startActivity(versionIntent);
            return true;

        } else {
            // Handle other menu items if needed
            return super.onOptionsItemSelected(item);
        }
    }
}